test/Malle/FSD/THM/system/blockMeshDict.burner
/*--------------------------------*- C++ -*----------------------------------*\
  Simplified UNIFORM slot-burner mesh (single resolution everywhere).
  Local 2x refinement of the 52x32mm inlet window is done AFTERWARDS via
  topoSet + refineMesh (system/topoSetDict, system/refineMeshDict), NOT by
  partitioning blocks here -- blockMesh cannot produce non-coincident
  hierarchical refinement directly (see thread discussion). This keeps the
  jet/lip/coflow band structure faithful to the real burner-lip geometry
  (surface_les.dat) without forcing fine resolution outside the refined box.
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 -0.08 -0.008)           // 0
    (0.308 -0.08 -0.008)       // 1
  //  (0 -0.0044 -0.008)       // 2 -> 4
  //  (0.308 -0.0044 -0.008)   // 3 -> 5
    (0 -0.004 -0.008)          // 4 -> 2
    (0.308 -0.004 -0.008)      // 5 -> 3
    (0 0.004 -0.008)           // 6 -> 4
    (0.308 0.004 -0.008)       // 7 -> 5
  //  (0 0.0044 -0.008)        // 8 - 6 -> 4
  //  (0.308 0.0044 -0.008)    // 9 - 7 -> 5
    (0 0.08 -0.008)            // 10 -> 6
    (0.308 0.08 -0.008)        // 11 -> 7
    (0 -0.08 0.008)            // 12 -> 8
    (0.308 -0.08 0.008)        // 13 -> 9
   // (0 -0.0044 0.008)        // 14 - 16
   // (0.308 -0.0044 0.008)    // 15 - 17
    (0 -0.004 0.008)           // 16 -> 10
    (0.308 -0.004 0.008)       // 17 -> 11
    (0 0.004 0.008)            // 18 -> 12
    (0.308 0.004 0.008)        // 19 -> 13
   // (0 0.0044 0.008)         // 20 - 18
   // (0.308 0.0044 0.008)     // 21 - 19
    (0 0.08 0.008)             // 22 -> 14
    (0.308 0.08 0.008)         // 23 -> 15
);

blocks
(
    hex (0 1 3 2 8 9 11 10)     (75 20 4)   simpleGrading (1 1 1)   // coflowBottom
    hex (2 3 5 4 10 11 13 12)   (75 4 4)   simpleGrading (1 1 1)   // jet
    hex (4 5 7 6 12 13 15 14)   (75 20 4)   simpleGrading (1 1 1)   // coflowTop
);

edges
(
);

boundary
(
    jetInlet
    {
        type patch;
        faces
        (
            (2 10 12 4)
        );
    }

    coflowInletBottom
    {
        type patch;
        faces
        (
            (0 8 10 2)
        );
    }

    coflowInletTop
    {
        type patch;
        faces
        (
            (4 12 14 6)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 3 11 9)
            (3 5 13 11)
            (5 7 15 13)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 1 9 8)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (6 14 15 7)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (8 9 11 10)
            (10 11 13 12)
            (12 13 15 14)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //