test/Malle/FSD/THM/constant/combustionProperties.FSDRelax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}

// ************************************************************************* //

combustionModel    FSD;

semiImplicit       false;

FSDCoeffs
{
    // FSD model
    Cv              1.0;
    ftVarMin        1.0e-6;

    // Flame surface / reaction-rate model
    reactionRateFlameArea    relaxation;
    semiImplicit false;

    fuel H2;
    relaxationCoeffs
    {
        C       5.0;
        alpha   0.0;

        H2
        {
            omega0      1.0;
            eta         0.0;
            sigmaExt    1.0e4;
            omegaMin    1.0e-4;
        }
    }
}


// ************************************************************************* //